examples/OF_dynamic_relaxation/appo/baseCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    squareU
    {
        type           squareU;
        libs           ("libsquareUFunctionObject.so");
        writeControl   timeStep;
        writeInterval  1;
    }
    // #includeFunc "stressComponents"
    // #includeFunc "pressureCoefficient"
    // #includeFunc "sample"
    // #includeFunc "sampleCp"
    // #includeFunc "writeCellCentres"
    // #includeFunc wallShearStress
}

// ************************************************************************* //
